{
    "main_menu": {
      "title": "OMRON PROXIMITY SENSOR SOLUTIONS",
      "description": "Omron proximity sensors are engineered for reliable non-contact detection in demanding industrial environments, providing precise sensing of metallic and non-metallic objects. These sensors are widely used in automation lines, packaging systems, and material handling applications where durability, accuracy, and consistent performance are critical. Their rugged construction ensures long service life even under vibration, dust, oil, and moisture exposure.",
      "features": [
        "High sensing accuracy with stable output",
        "Robust metal housings for industrial use",
        "Wide voltage range compatibility",
        "Fast switching response for high-speed automation",
        "Superior resistance to electrical noise",
        "Long operational life with minimal maintenance"
      ],
      "models": {
        "menu_drop1": {
          "name": "E2B Series",
          "description": "The Omron E2B Series inductive proximity sensors are designed for dependable metal object detection in harsh factory conditions. They feature strong mechanical durability, excellent noise immunity, and long sensing distances, making them ideal for conveyor systems, machine tools, and automated production equipment. Their compact cylindrical design allows easy installation even in space-limited control panels while ensuring consistent long-term performance.",
          "image": "https://assets.omron.eu/images/proximity-sensors-e2b-series.jpg",
          "badge": "INDUSTRIAL GRADE",
          "specs": [
            "Sensing distance up to 15 mm",
            "M8, M12, M18, M30 housing options",
            "PNP and NPN output variants",
            "IP67 protection rating",
            "High resistance to vibration and impact"
          ]
        },
        "menu_drop2": {
          "name": "E2A Series",
          "description": "The E2A Series offers a cost-effective sensing solution without compromising reliability or performance. These proximity sensors provide stable detection in standard automation environments and are widely used in packaging machines, assembly lines, and automated sorting systems. Their simple wiring design and LED operation indicators allow quick installation and easy troubleshooting for maintenance teams.",
          "image": "https://assets.omron.eu/images/proximity-sensors-e2a-series.jpg",
          "badge": "ECONOMY SERIES",
          "specs": [
            "Compact body structure",
            "Short-circuit and reverse polarity protection",
            "Clear LED status indicator",
            "Long service life design"
          ]
        },
        "menu_drop3": {
          "name": "Inductive Sensors",
          "description": "Omron inductive sensors provide highly accurate metal detection with extended sensing ranges and superior reliability in demanding industrial processes. They are specifically designed to operate consistently in high-speed automation environments where precise object positioning is essential. Their durable design ensures stable performance even in the presence of oil mist, dust, vibration, and temperature fluctuations.",
          "image": "https://assets.omron.eu/images/inductive-proximity-sensor.jpg",
          "badge": "PRECISION SENSING",
          "specs": [
            "Shielded and non-shielded versions",
            "High-frequency switching capability",
            "Extended detection range",
            "Excellent temperature stability"
          ]
        },
        "menu_drop4": {
          "name": "Capacitive Sensors",
          "description": "Omron capacitive proximity sensors are capable of detecting a wide variety of materials including plastic, glass, powders, liquids, and granules. These sensors are commonly used in level detection applications such as tanks, silos, and hoppers, as well as packaging machinery. Their adjustable sensitivity allows fine-tuning for reliable operation across different material types and environmental conditions.",
          "image": "https://assets.omron.eu/images/capacitive-proximity-sensor.jpg",
          "badge": "MULTI MATERIAL",
          "specs": [
            "Detects both metallic and non-metallic objects",
            "Sensitivity adjustment control",
            "Stable detection through container walls",
            "High environmental resistance"
          ]
        },
        "menu_drop5": {
          "name": "Pre Wired Sensors",
          "description": "Pre-wired proximity sensors from Omron are designed to simplify installation and reduce wiring time in industrial automation systems. These sensors come with factory-attached cables that ensure secure connections and minimize field wiring errors. They are ideal for fast deployment in conveyor systems, assembly machines, and production lines requiring quick sensor replacement.",
          "image": "https://assets.omron.eu/images/prewired-proximity-sensor.jpg",
          "badge": "QUICK INSTALL",
          "specs": [
            "Factory-attached durable cable",
            "Improved resistance to mechanical stress",
            "Fast installation with reduced downtime"
          ]
        },
        "menu_drop6": {
          "name": "M12 Connector Type",
          "description": "Omron M12 connector type proximity sensors provide flexible wiring and fast maintenance through standardized industrial connectors. These sensors are particularly suitable for modular automation systems where frequent replacement or reconfiguration is required. The secure locking mechanism ensures stable signal transmission even under vibration-heavy industrial conditions.",
          "image": "https://assets.omron.eu/images/m12-proximity-sensor.jpg",
          "badge": "MODULAR",
          "specs": [
            "Standard M12 industrial connector",
            "Quick plug-and-play replacement",
            "High vibration resistance",
            "Reliable signal transmission"
          ]
        }
      }
    }
  }
  